public class Task1_5_問四 {

    public static void main(String[] args) {
        // ④ Wikiに掲載されている【多重ループのプログラム例 （九九表を表示）】を参考に、
        // *    行の最初に「段数」と「||」を追加したものを表示させるプログラムを作成しなさい。
        // *     1 || 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 |
        // *     2 || 2 | 4 | 6 | 8 | 10 | 12 | 14 | 16 | 18 |
        // *     3 || 3 | 6 | 9 | 12 | 15 | 18 | 21 | 24 | 27 |
        // *     4 || 4 | 8 | 12 | 16 | 20 | 24 | 28 | 32 | 36 |
        // *     5 || 5 | 10 | 15 | 20 | 25 | 30 | 35 | 40 | 45 |
        // *     6 || 6 | 12 | 18 | 24 | 30 | 36 | 42 | 48 | 54 |
        // *     7 || 7 | 14 | 21 | 28 | 35 | 42 | 49 | 56 | 63 |
        // *     8 || 8 | 16 | 24 | 32 | 40 | 48 | 56 | 64 | 72 |
        // *     9 || 9 | 18 | 27 | 36 | 45 | 54 | 63 | 72 | 81 |
           for(int p=1; p<=9; p++){
             System.out.print(p + " || ");
             for(int j=1; j<=9; j++){
                 System.out.print(p * j + " | ");
                }
                System.out.println("\n");
           }
    }
 }